Repository: Sokolice/Hestia
Catalog: Hestia.UI/Strings/*/Resources.resw
Source language: en_us
Languages: cs_cz

# btnConfig.Label
source: Configuration
cs_cz: Konfigurace

# btnControl.Label
source: Control
cs_cz: Ovládání

# btnHelp.Label
source: Help
cs_cz: Nápověda

# btnSet.Label
source: Settings
cs_cz: Nastavení

# txtBlinds.Text
source: Blinds
cs_cz: Žaluzie

# cmbCzech.Text
source: Czech
cs_cz: Čeština

# cmbEng.Text
source: English
cs_cz: Angličtina

# errChooseDeviceDel
source: Please select the device to delete.
cs_cz: Vyberte zařízení pro smazání.

# errChooseRomeForInsert
source: Please choose room for device to insert.
cs_cz: Zvolte místnost pro vložení zařízení.

# errChooseRoomDel
source: Please select the room to delete.
cs_cz: Vyberte místnost pro smazání.

# errWarningHeader
source: Warning
cs_cz: Upozornění

# HeaderConfiguration.Text
source: Configuration
cs_cz: Konfigurace

# infoListening
source: Listening ...
cs_cz: Poslouchám ...

# infoReady
source: Ready.
cs_cz: Připraveno.

# infoSpeechNotAvailable
source: Voice control is not available.
cs_cz: Hlasové ovládání není k dispozici

# txtCategory.Text
source: Category
cs_cz: Kategorie

# txtControlHeader.Text
source: Control
cs_cz: Ovládání

# txtDelete.Text
source:  Delete selected
cs_cz:  Smazat označené

# txtDimming.Text
source: Dimming
cs_cz: Stmívání

# txtHelp.Text
source: Help
cs_cz: Nápověda

# txtInsert.Text
source:  Insert
cs_cz:  Vložit

# txtLightState.Text
source: Light state
cs_cz: Stav světla

# txtListDevices.Text
source: List of devices
cs_cz: Seznam zařízení

# txtMovementValue.Text
source: Value of movement
cs_cz: Výška žaluzie

# txtName.Text
source: Name
cs_cz: Název

# txtNewDevice.Text
source: New device
cs_cz: Nové zařízení

# txtNewRoom.Text
source: New room
cs_cz: Nová místnost

# txtNumOfDevice.Text
source: Number of devices:
cs_cz: Počet zařízeni:

# txtOnOff.Text
source: On/off
cs_cz: Vypnout/zapnout

# txtRoomList.Text
source: List of rooms
cs_cz: Seznam místností

# txtSave.Text
source:  Save
cs_cz:  Uložit

# txtSetHeader.Text
source: Settings
cs_cz: Nastavení

# txtSlatTilt.Text
source: Slat tilt
cs_cz: Naklonění lamel

# txtUpDown.Text
source: Movement up /down
cs_cz: Pohyb nahoru/dolů

# errSave
source: An error occured while saving.
cs_cz: Došlo k chybě při ukládání konfigurace.

# infoRepeatCommand
source: Please repeat command.
cs_cz: Zopakujte prosím příkaz.

# speechNewDevAddress
source: Please fill any of new device address
cs_cz: Vyplňte alespoň jednu ze skupinových adres

# speechNewDevName
source: Please fill new device name.
cs_cz: Prosím vyplňte název zařízení.

# speechNewRoomName
source: Please fill new room name.
cs_cz: Prosím vyplňte název místnosti.

# warNewDevAddress
source: Please fill any of group addresses in correct format.
cs_cz: Vyplňte alespoň jednu skupinovou adresu pro zařízení ve správném formátu.

# warNewDevName
source: Please fill new device name
cs_cz: Vyplňte prosím jméno nového zařízení

# warNewRoomName
source: Please fill new room name.
cs_cz: Vyplňte prosím jméno nové místnosti.

# txtLanguage.Text
source: Language:
cs_cz: Jazyk:

# cmbDark.Text
source: Dark
cs_cz: Tmavé

# cmbLight.Text
source: Light
cs_cz: Světlé

# infoOff
source: Off
cs_cz: Vypnuto

# txtOpenConfig.Text
source: Open configuration
cs_cz: Otevřít konfiguraci

# cmbLarge.Text
source: Large
cs_cz: Velké

# cmbMedium.Text
source: Medium
cs_cz: Střední

# cmbSmall.Text
source: Small
cs_cz: Malé

# txtFontSize.Text
source: Font size
cs_cz: Velikost písma

# txtTheme.Text
source: Theme
cs_cz: Barevné schéma

# txtOn
source: On
cs_cz: Zapnuto

# txtLights.Text
source: Lights
cs_cz: Osvětlení

# txtLangWarning.Text
source: The language will be changed after application is restarted
cs_cz: Změna jazyka se projeví po restartování aplikace

# txtDown
source: Down
cs_cz: Dolů

# txtUp
source: Up
cs_cz: Nahoru

# txtConfigurationDescription.Text
source: For the application to work properly it is needed to perform configuration. Configuration can be accessed from the Settings page, pressing the "Open configuration" button. Configuration should be performed only by a person familiar with the KNX system. In the configuration phase, rooms and devices inside the building are mapped. A working configuration requires the knowledge of group addresses of individual devices and their programmed funtions.
cs_cz: Pro správnou funkci aplikace je potřeba provést konfiguraci. Ke konfiguraci lze přistoupit z obrazovky Nastavení stisknutím tlačítka "Otevřít konfiguraci". Konfiguraci by měla provádět osoba obeznámená se systémem KNX. V konfigurační fázi se mapují místnosti a zařízení v budově. Pro správnou konfiguraci je nutné znát skupinové adresy zařízení a jejich naprogramované funkce.

# txtControlDescription.Text
source: The building control page is composed of left and right part. The left part contains a list of rooms. After choosing a room, respective devices are displayed in the right part. Specific control items are rendered according to configured functions of individual devices.
cs_cz: Obrazovka pro ovládání budovy se skládá z levé a pravé části. V levé části je zobrazen seznam místností. V pravé části jsou po výběru místnosti zobrazeny zařízení. Podle nakonfigurovaných funkcí zařízení se zobrazí specifické ovládací prvky.

# txtManualDescription.Text
source: Detailed application usage information are written in the user manual.
cs_cz: Podrobnější informace k použivání aplikace jsou uvedeny v uživatelské příručce.

# txtSettingsDescription.Text
source: For easier interaction with the application, several settings can be adjusted. One of two colour schemes can be chosen (light, dark). The user can choose one of three font sizes (small, medium, large) and one of two languages (Czech, English).
cs_cz: Pro zjednodušení práce s aplikací lze upravit několik nastavení. Je možné vybrat ze dvou barevných schémat (světlé, tmavé). Dále je možné vybrat ze tří velikostí písma (malé, střední, velké) a ze dvou jazyků (Čeština, Angličtina).

# txtUserManual.Text
source: User manual
cs_cz: Uživatelská přiručka
